package day03;

public class TestBitLogic {
    public static void main(String[] args) {
        System.out.println( 5 & 3);
        /*
        5的二进制补码：00000000 00000000 00000000 00000101
        3的二进制补码：00000000 00000000 00000000 00000011
        5 & 3     : 00000000 00000000 00000000 00000001（十进制1）

        计算机硬件（如 CPU 的运算单元）处理数据时，需要统一的位数格式才能高效运算（比如加法、减法等），避免因数据长度不一致导致的逻辑混乱。
        由于默认的整数字面量是int，所以这里的5和3都是int类型，所以5的二进制补码和3的二进制补码都是32位，前面的数值部分直接用0填充
         */

        System.out.println( 5 | 3);
        /*
        5的二进制补码：00000000 00000000 00000000 00000101
        3的二进制补码：00000000 00000000 00000000 00000011
        5 | 3     : 00000000 00000000 00000000 00000111（十进制7）
         */

        System.out.println( 5 ^ 3);
        /*
        5的二进制补码：00000000 00000000 00000000 00000101
        3的二进制补码：00000000 00000000 00000000 00000011
        5 ^ 3     : 00000000 00000000 00000000 00000110（十进制6）

         */


    }
}
